{
   "California Institute of Technology (Caltech)": "The California Institute of Technology, commonly known as Caltech, is a prestigious private research university located in Pasadena, California. It is renowned for its strong emphasis on science and engineering, with a focus on hands-on learning and cutting-edge research opportunities.",
   "Harvard University": "Harvard University is a prestigious Ivy League institution located in Cambridge, Massachusetts. It was founded in 1636 and is one of the oldest higher education institutions in the United States.",
   "MIT": "The Massachusetts Institute of Technology (MIT) is a private research university located in Cambridge, Massachusetts, and is known for its prominent programs in engineering and technology. Established in 1861, MIT has produced countless notable alumni and is consistently ranked as one of the world's top universities.",
   "Massachusetts Institute of Technology (MIT)": "The Massachusetts Institute of Technology, commonly known as MIT, is a prestigious private research university located in Cambridge, Massachusetts. It is consistently ranked among the top universities globally for its rigorous academic programs and cutting-edge research facilities.",
   "University of California, Berkeley": "The University of California, Berkeley is a public research university located in Berkeley, California. It is one of the most prestigious universities in the United States and is known for its strong programs in engineering, natural sciences, and social sciences.",
   "Stanford University": "Stanford University is a private research university located in Stanford, California. It was founded in 1885 by Leland and Jane Stanford in memory of their only child, who died at an early age. The university is known for its strong emphasis on interdisciplinary studies and innovation.",
   "Carnegie Mellon University": "Carnegie Mellon University is a private research university located in Pittsburgh, Pennsylvania. It is known for its strong programs in computer science, engineering, and design.",
   "Princeton University": "Princeton University is a prestigious Ivy League institution located in New Jersey, known for its rigorous academic programs and impressive alumni network. Established in 1746, it is one of the oldest universities in the United States."
}
